HELYXcore-4.4.0/examples/legacy/lagrangian/sprayFoam/aachenBomb/0/p
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// ************************************************************************* //

dimensions          [1 -1 -2 0 0 0 0];

internalField       uniform 5e+06;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
