HELYXcore-4.4.0/examples/legacy/lagrangian/sprayFoam/aachenBomb/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

# Set application name
application=$(getApplication)

runApplication chemkinToFoam  \
               chemkin/chem.inp chemkin/therm.dat chemkin/transportProperties \
               constant/reactions system/thermo

runApplication blockMesh
runApplication $application

#------------------------------------------------------------------------------