HELYXcore-4.4.0/examples/legacy/lagrangian/sprayFoam/aachenBomb/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    solver   ode;
}

chemistry       on;

initialChemicalTimeStep 1e-07;

odeCoeffs
{
    solver          seulex;
    eps             0.05;
}

#include "reactions"

// ************************************************************************* //
