HELYXcore-4.4.0/examples/legacy/lagrangian/sprayFoam/aachenBomb/system/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      materialProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

materialType    fluid;
mixture         standardMixture;
energy          sensibleEnthalpy;

newFormat       yes;

defaultSpecie     N2;

liquids { C7H16; }

solids {}

#include "thermo"

// ************************************************************************* //
